In [1]:
import numpy as np
import pandas as pd

seriler

In [4]:
benimSozlugum={"nuray":21,"oytun":20}

In [6]:
pd.Series(benimSozlugum)

nuray    21
oytun    20
dtype: int64

In [8]:
benimYaslarim=[50,49,5]
benimIsimlerim=["nuray","oytun","x"]

In [10]:
pd.Series(benimYaslarim,benimIsimlerim)

nuray    50
oytun    49
x         5
dtype: int64

In [12]:
pd.Series(data=benimYaslarim,index=benimIsimlerim)

nuray    50
oytun    49
x         5
dtype: int64

In [18]:
numpyDizisi=np.array([50,60,70])

In [20]:
numpyDizisi

array([50, 60, 70])

In [22]:
pd.Series(numpyDizisi)

0    50
1    60
2    70
dtype: int64

In [24]:
pd.Series(numpyDizisi,benimIsimlerim)

nuray    50
oytun    60
x        70
dtype: int64

In [28]:
pd.Series(["nfj","vnfkd","fnjdknkd"],[1,2,3])

1         nfj
2       vnfkd
3    fnjdknkd
dtype: object

In [32]:
yarismaSonucu1=pd.Series([10,5,4],["nfj","vnfkd","fnjdknkd"])

In [33]:
yarismaSonucu1

nfj         10
vnfkd        5
fnjdknkd     4
dtype: int64

In [36]:
yarismaSonucu2=pd.Series([15,2,1],["nfj","vnfkd","fnjdknkd"])

In [38]:
yarismaSonucu2

nfj         15
vnfkd        2
fnjdknkd     1
dtype: int64

In [40]:
yarismaSonucu2["nfj"]

15

In [44]:
sosonuc=yarismaSonucu1+yarismaSonucu2

In [46]:
sosonuc

nfj         25
vnfkd        7
fnjdknkd     5
dtype: int64

In [54]:
farkliSeries=pd.Series([20,30,40],["a","b","c"])
farkliSeries2=pd.Series([10,5,3],["a","c","f"])

In [56]:
farkliSeries+farkliSeries2

a    30.0
b     NaN
c    45.0
f     NaN
dtype: float64

dataframe

In [75]:
data=np.random.randn(4,4)

In [77]:
data

array([[-1.13426333,  0.94958567, -1.9196502 ,  0.46705358],
       [-1.87958106,  1.70253811, -2.41658925, -1.24930981],
       [ 0.96582692, -0.54184786, -0.09331409, -0.30932517],
       [-0.26830578,  0.27733064,  0.75702788, -1.77338806]])

In [80]:
dataFrame=pd.DataFrame(data)
dataFrame

          0         1         2         3
0 -1.134263  0.949586 -1.919650  0.467054
1 -1.879581  1.702538 -2.416589 -1.249310
2  0.965827 -0.541848 -0.093314 -0.309325
3 -0.268306  0.277331  0.757028 -1.773388

In [82]:
yeniDataFrame=pd.DataFrame(data,index=["a","b","c","d"],columns=["maas","yas","saat","x"])

In [84]:
yeniDataFrame

       maas       yas      saat         x
a -1.134263  0.949586 -1.919650  0.467054
b -1.879581  1.702538 -2.416589 -1.249310
c  0.965827 -0.541848 -0.093314 -0.309325
d -0.268306  0.277331  0.757028 -1.773388

In [86]:
yeniDataFrame["yas"]

a    0.949586
b    1.702538
c   -0.541848
d    0.277331
Name: yas, dtype: float64

In [88]:
yeniDataFrame.loc["a"]

maas   -1.134263
yas     0.949586
saat   -1.919650
x       0.467054
Name: a, dtype: float64

In [90]:
yeniDataFrame.iloc[1]

maas   -1.879581
yas     1.702538
saat   -2.416589
x      -1.249310
Name: b, dtype: float64

In [96]:
yeniDataFrame["emeklilik yası"]=yeniDataFrame["yas"]+yeniDataFrame["yas"]

In [97]:
yeniDataFrame

       maas       yas      saat         x  emeklilik yası
a -1.134263  0.949586 -1.919650  0.467054        1.899171
b -1.879581  1.702538 -2.416589 -1.249310        3.405076
c  0.965827 -0.541848 -0.093314 -0.309325       -1.083696
d -0.268306  0.277331  0.757028 -1.773388        0.554661

In [106]:
yeniDataFrame.drop("emeklilik yası",axis=1)

       maas       yas      saat         x
a -1.134263  0.949586 -1.919650  0.467054
b -1.879581  1.702538 -2.416589 -1.249310
c  0.965827 -0.541848 -0.093314 -0.309325
d -0.268306  0.277331  0.757028 -1.773388

In [114]:
yeniDataFrame.drop("b")

       maas       yas      saat         x  emeklilik yası
a -1.134263  0.949586 -1.919650  0.467054        1.899171
c  0.965827 -0.541848 -0.093314 -0.309325       -1.083696
d -0.268306  0.277331  0.757028 -1.773388        0.554661

In [116]:
yeniDataFrame.drop("emeklilik yası",axis=1,inplace=True)

In [118]:
yeniDataFrame

       maas       yas      saat         x
a -1.134263  0.949586 -1.919650  0.467054
b -1.879581  1.702538 -2.416589 -1.249310
c  0.965827 -0.541848 -0.093314 -0.309325
d -0.268306  0.277331  0.757028 -1.773388

In [122]:
yeniDataFrame<0

    maas    yas   saat      x
a   True  False   True  False
b   True  False   True   True
c  False   True   True   True
d   True  False  False   True

In [130]:
yeniDataFrame[yeniDataFrame["maas"]>0]

       maas       yas      saat         x
c  0.965827 -0.541848 -0.093314 -0.309325

In [132]:
yeniDataFrame.reset_index()

  index      maas       yas      saat         x
0     a -1.134263  0.949586 -1.919650  0.467054
1     b -1.879581  1.702538 -2.416589 -1.249310
2     c  0.965827 -0.541848 -0.093314 -0.309325
3     d -0.268306  0.277331  0.757028 -1.773388

In [134]:
yeniIndexListesi=["ddd","aaa","sss","eee"]

In [136]:
yeniDataFrame["yeni index"]=yeniIndexListesi

In [138]:
yeniDataFrame

       maas       yas      saat         x yeni index
a -1.134263  0.949586 -1.919650  0.467054        ddd
b -1.879581  1.702538 -2.416589 -1.249310        aaa
c  0.965827 -0.541848 -0.093314 -0.309325        sss
d -0.268306  0.277331  0.757028 -1.773388        eee

In [140]:
yeniDataFrame.set_index("yeni index")

                maas       yas      saat         x
yeni index
ddd        -1.134263  0.949586 -1.919650  0.467054
aaa        -1.879581  1.702538 -2.416589 -1.249310
sss         0.965827 -0.541848 -0.093314 -0.309325
eee        -0.268306  0.277331  0.757028 -1.773388

In [142]:
yeniDataFrame.set_index("yeni index", inplace=True)

In [144]:
yeniDataFrame

                maas       yas      saat         x
yeni index
ddd        -1.134263  0.949586 -1.919650  0.467054
aaa        -1.879581  1.702538 -2.416589 -1.249310
sss         0.965827 -0.541848 -0.093314 -0.309325
eee        -0.268306  0.277331  0.757028 -1.773388

In [146]:
ilkIndexler=["s","s","s","p","p","p"]

In [148]:
icIndexler=["h","b","m","c","k","l"]

In [150]:
birlesmisIndex=list(zip(ilkIndexler,icIndexler))

In [152]:
birlesmisIndex

[('s', 'h'), ('s', 'b'), ('s', 'm'), ('p', 'c'), ('p', 'k'), ('p', 'l')]

In [154]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [156]:
birlesmisIndex

MultiIndex([('s', 'h'),
            ('s', 'b'),
            ('s', 'm'),
            ('p', 'c'),
            ('p', 'k'),
            ('p', 'l')],
           )

In [158]:
benimCizgiFilmListem=[[40,"a"],[10,"b"],[30,"c"],[50,"d"],[70,"e"],[100,"k"]]

In [160]:
cizgiFilmNumpyDizisi=np.array(benimCizgiFilmListem)

In [162]:
cizgiFilmDataFrame=pd.Dataframe(cizgiFilmNumpyDizisi,index=birlesmisIndex,columns=["yas","meslek"])

AttributeError: module 'pandas' has no attribute 'Dataframe'

In [168]:
sozlukVerisi={"ıstanbul":[30,29,np.nan],"ankara":[20,np.nan,25], "izmir":[40,39,28]}

In [173]:
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [175]:
havaDurumuDataFrame

   ıstanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     28

In [177]:
havaDurumuDataFrame.dropna()

   ıstanbul  ankara  izmir
0      30.0    20.0     40

In [179]:
havaDurumuDataFrame.dropna(axis=1)

   izmir
0     40
1     39
2     28

In [180]:
havaDurumuDataFrame

   ıstanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     28

In [193]:
yeniVerisi={"ıstanbul":[30,29,np.nan],"ankara":[20,np.nan,25], "izmir":[40,39,28],"antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVerisi)

In [195]:
yeniDataFrame

   ıstanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     28      NaN

In [199]:
yeniDataFrame.dropna(axis=1,thresh=2)

   ıstanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     28

In [201]:
yeniDataFrame.fillna(20)

   ıstanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     28     20.0

In [209]:
maasSozlugu={"departman":["yazılım","yazılım","pazalama","pazarlama","ik","ik"],
            "calisan ismi":["ahmet","mehmet","atil","burak","zeynep","fatma"],
             "maas":[100,150,200,300,400,500]
            }

In [211]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [213]:
maasDataFrame

   departman calisan ismi  maas
0    yazılım        ahmet   100
1    yazılım       mehmet   150
2   pazalama         atil   200
3  pazarlama        burak   300
4         ik       zeynep   400
5         ik        fatma   500

In [229]:
grupObjesi=maasDataFrame.groupby("departman")
grupObjesi.count()

           calisan ismi  maas
departman
ik                    2     2
pazalama              1     1
pazarlama             1     1
yazılım               2     2

In [232]:
grupObjesi.describe()

           maas
          count   mean        std    min    25%    50%    75%    max
departman
ik          2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
pazalama    1.0  200.0        NaN  200.0  200.0  200.0  200.0  200.0
pazarlama   1.0  300.0        NaN  300.0  300.0  300.0  300.0  300.0
yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

In [2]:
sozluk1={"isim":["ahmet","mehmet","zeynep"],
        "spor": ["koşu","yüzme","yüzme"],
        "kalori": [100,200,300]}

In [14]:
import pandas as pd
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2])

In [16]:
dataFrame1

     isim   spor  kalori
0   ahmet   koşu     100
1  mehmet  yüzme     200
2  zeynep  yüzme     300

In [18]:
sozluk2={"isim":["osman","levent","aslan"],
        "spor": ["koşu","yüzme","basketbol"],
        "kalori": [100,200,350]}

In [20]:
dataFrame2=pd.DataFrame(sozluk2,index=[3,4,5])

In [22]:
sozluk3={"isim":["ayse","mahmut","duygu"],
        "spor": ["koşu","yüzme","tenis"],
        "kalori": [150,290,300]}
dataFrame3=pd.DataFrame(sozluk3,index=[6,7,8])

concatenation

In [31]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0) #axis 1 oluncA YAN YANA YAZAR

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2  zeynep      yüzme     300
3   osman       koşu     100
4  levent      yüzme     200
5   aslan  basketbol     350
6    ayse       koşu     150
7  mahmut      yüzme     290
8   duygu      tenis     300

merge

In [38]:
mergeSozluk1={"isim":["ayse","mahmut","duygu"],
              "spor": ["koşu","yüzme","tenis"]
                       }
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [39]:
mergeSozluk2={"isim":["ayse","mahmut","duygu"],
              "kalori": [1,2,3]
                       }
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [42]:
pd.merge(mergeDataFrame2,mergeDataFrame1,on="isim")

     isim  kalori   spor
0    ayse       1   koşu
1  mahmut       2  yüzme
2   duygu       3  tenis

In [44]:
maasSozluk={"isim":["ayse","mahmut","duygu"],
            "departman": ["yazılım","satış","yazılım"],
            "maas": [1,2,3]
           }

In [46]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [48]:
maasDataFrame

     isim departman  maas
0    ayse   yazılım     1
1  mahmut     satış     2
2   duygu   yazılım     3

In [56]:
maasDataFrame["departman"].unique()

array(['yazılım', 'satış'], dtype=object)

In [59]:
maasDataFrame["departman"].nunique()

2

In [61]:
maasDataFrame["departman"].value_counts()

departman
yazılım    2
satış      1
Name: count, dtype: int64

In [67]:
def bruttenNete(maas):
     return maas*0.66

In [69]:
maasDataFrame["maas"].apply(bruttenNete)

0    0.66
1    1.32
2    1.98
Name: maas, dtype: float64

In [71]:
maasDataFrame.isnull()

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False

In [87]:
yeniBirVeri={"karakter sınıfı":["s","s","i","i"],
             "karakterismi":["c","k","h","b"],
             "karakter ya":[9,10,11,12]
            }

In [88]:
karakterDf=pd.DataFrame(yeniBirVeri)

In [89]:
karakterDf

  karakter sınıfı karakterismi  karakter ya
0               s            c            9
1               s            k           10
2               i            h           11
3               i            b           12

In [100]:
import numpy as np
karakterDf.pivot_table(values="karakter ya", index=["karakter sınıfı","karakterismi"],aggfunc=np.sum)

                              karakter ya
karakter sınıfı karakterismi
i               b                      12
                h                      11
s               c                       9
                k                      10

In [ ]:
import pandas as pd
dataFrame=pd.read_excel("dosyanın ismi")